content/thinking/深度思维.org
# -*- coding:utf-8-*-
#+TITLE: 深度思维笔记
#+AUTHOR: liushangliang
#+EMAIL: phenix3443+github@gmail.com

* 分类
  + 技术类思维方式，方法论，微观
  + 格局类思维方式，世界观，宏观

* 深度逻辑思维
** what
   延长思维逻辑链条。基本原则：适度性与合理性。

** why
   + 掌握事物规律，准确判断长远发展。
   + 发掘现象本质，从根本上解决问题。

** how
*** 5 so 思考法（向后）
    + 推论到概率足够小停止。
    + 过段时间再看之前概率较小的推论是不是已经发生，然后继续推论。

*** 5 why 思考法（向前）
    + 追问到问题没有意义。
    + 回答要自己可控。

** 训练
   + 通过数学，象棋，逻辑学，批判思维方面的书籍。
   + 日常生活随机练习。
   + 深厚的专业知识有利于推论。

* 生态思维

** what
   思考个体的同时，也要考虑它所处的的环境对其行为的影响。

** why
   事物是彼此联系的。

** how
   + 思考别人的需求和痛点。
   + 旁敲侧击
   + 与换位思维结合使用。

** 衍生模型
   + 淘金模型，共生双赢
   + 森林模型，避开强者
   + 池塘模型，做平台

* 换位思维

** how
   + 从利益思考
   + 从他人所在生态思考
   + 从他人视角，需要有（部分）共同的认知

** 克服个人为中心
   + 经常问自己“如果是我他，我会怎么做”
   + 建立抽离感
   + 观察他人的喜好

** 训练
   + 从经历与认知着手
   + 从逻辑推演着手
   + 从细微观察着手

* 兵法思维

** 先胜后战
   本质:如何平衡机会和风险。

*** 凯利公式
    用凯利公式计算可能性：

    f=(p_{w}r_{w}-p_{l}r_{l})/r_{w}r_{l}

    + p_{w}赢的概率，r_{w}赢了赚多少倍
    + p_{l}输的概率，r_{l}输了亏多少倍

** 致人而不致于人
   本质：如何识别隐藏风险，掌握主动权。

   不要让自己处于两难的情形中，要让自己进退自如。

** 胜可知而不可为
   本质：没有机会的时候要充实自己，不要逆势而为。

* 创造性思维

** 奥斯本核检表
   用电扇举例：

   + 他用，物品用作他用。（吹凉->摄影吹头发）
   + 借用，借用过往经验，类比参考法。
   + 扩大，增加功能、性能。（常温->冷风，热风）
   + 缩小，减少功能等。（正常尺寸->车载，微型，吹风->赶苍蝇）
   + 改变，外观形状，气味，功能等。（彩色扇叶）
   + 代用，替代全部或部分功能，材料，颜色等。（遥控电扇）
   + 调整，操作工序（变速）。
   + 颠倒，正反，前后，功能作用方式。（吹风->抽风，座扇->吊扇）
   + 组合，多个物件进行组合配套。（吹蚊香液，发光电扇）

** 乘法式创新

** 强制联想法

* 大势思维
