thinking/深度思维.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-26 日 10:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>深度思维笔记</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">深度思维笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf06a5bf">1. 分类</a></li>
<li><a href="#org4ccafa9">2. 深度逻辑思维</a>
<ul>
<li><a href="#org3616aa4">2.1. what</a></li>
<li><a href="#org40aaa55">2.2. why</a></li>
<li><a href="#org881cb44">2.3. how</a>
<ul>
<li><a href="#org3f2a689">2.3.1. 5 so 思考法（向后）</a></li>
<li><a href="#orgc5bde7b">2.3.2. 5 why 思考法（向前）</a></li>
</ul>
</li>
<li><a href="#org504a1c8">2.4. 训练</a></li>
</ul>
</li>
<li><a href="#org127864e">3. 生态思维</a>
<ul>
<li><a href="#org581e835">3.1. what</a></li>
<li><a href="#org1d43607">3.2. why</a></li>
<li><a href="#org75093ad">3.3. how</a></li>
<li><a href="#org73b6647">3.4. 衍生模型</a></li>
</ul>
</li>
<li><a href="#orgaaf9f08">4. 换位思维</a>
<ul>
<li><a href="#org12f82bb">4.1. how</a></li>
<li><a href="#org874c086">4.2. 克服个人为中心</a></li>
<li><a href="#orgc4c6092">4.3. 训练</a></li>
</ul>
</li>
<li><a href="#orga0a229e">5. 兵法思维</a>
<ul>
<li><a href="#org01cb93f">5.1. 先胜后战</a>
<ul>
<li><a href="#org055ba57">5.1.1. 凯利公式</a></li>
</ul>
</li>
<li><a href="#orgafa08c2">5.2. 致人而不致于人</a></li>
<li><a href="#org5c08f53">5.3. 胜可知而不可为</a></li>
</ul>
</li>
<li><a href="#org859eb72">6. 创造性思维</a>
<ul>
<li><a href="#org018c358">6.1. 奥斯本核检表</a></li>
<li><a href="#org3b996d5">6.2. 乘法式创新</a></li>
<li><a href="#org4df191b">6.3. 强制联想法</a></li>
</ul>
</li>
<li><a href="#orgb4fdd30">7. 大势思维</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf06a5bf" class="outline-2">
<h2 id="orgf06a5bf"><span class="section-number-2">1</span> 分类</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>技术类思维方式，方法论，微观</li>
<li>格局类思维方式，世界观，宏观</li>
</ul>
</div>
</div>

<div id="outline-container-org4ccafa9" class="outline-2">
<h2 id="org4ccafa9"><span class="section-number-2">2</span> 深度逻辑思维</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org3616aa4" class="outline-3">
<h3 id="org3616aa4"><span class="section-number-3">2.1</span> what</h3>
<div class="outline-text-3" id="text-2-1">
<p>
延长思维逻辑链条。基本原则：适度性与合理性。
</p>
</div>
</div>

<div id="outline-container-org40aaa55" class="outline-3">
<h3 id="org40aaa55"><span class="section-number-3">2.2</span> why</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>掌握事物规律，准确判断长远发展。</li>
<li>发掘现象本质，从根本上解决问题。</li>
</ul>
</div>
</div>

<div id="outline-container-org881cb44" class="outline-3">
<h3 id="org881cb44"><span class="section-number-3">2.3</span> how</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org3f2a689" class="outline-4">
<h4 id="org3f2a689"><span class="section-number-4">2.3.1</span> 5 so 思考法（向后）</h4>
<div class="outline-text-4" id="text-2-3-1">
<ul class="org-ul">
<li>推论到概率足够小停止。</li>
<li>过段时间再看之前概率较小的推论是不是已经发生，然后继续推论。</li>
</ul>
</div>
</div>

<div id="outline-container-orgc5bde7b" class="outline-4">
<h4 id="orgc5bde7b"><span class="section-number-4">2.3.2</span> 5 why 思考法（向前）</h4>
<div class="outline-text-4" id="text-2-3-2">
<ul class="org-ul">
<li>追问到问题没有意义。</li>
<li>回答要自己可控。</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org504a1c8" class="outline-3">
<h3 id="org504a1c8"><span class="section-number-3">2.4</span> 训练</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>通过数学，象棋，逻辑学，批判思维方面的书籍。</li>
<li>日常生活随机练习。</li>
<li>深厚的专业知识有利于推论。</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org127864e" class="outline-2">
<h2 id="org127864e"><span class="section-number-2">3</span> 生态思维</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org581e835" class="outline-3">
<h3 id="org581e835"><span class="section-number-3">3.1</span> what</h3>
<div class="outline-text-3" id="text-3-1">
<p>
思考个体的同时，也要考虑它所处的的环境对其行为的影响。
</p>
</div>
</div>

<div id="outline-container-org1d43607" class="outline-3">
<h3 id="org1d43607"><span class="section-number-3">3.2</span> why</h3>
<div class="outline-text-3" id="text-3-2">
<p>
事物是彼此联系的。
</p>
</div>
</div>

<div id="outline-container-org75093ad" class="outline-3">
<h3 id="org75093ad"><span class="section-number-3">3.3</span> how</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>思考别人的需求和痛点。</li>
<li>旁敲侧击</li>
<li>与换位思维结合使用。</li>
</ul>
</div>
</div>

<div id="outline-container-org73b6647" class="outline-3">
<h3 id="org73b6647"><span class="section-number-3">3.4</span> 衍生模型</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>淘金模型，共生双赢</li>
<li>森林模型，避开强者</li>
<li>池塘模型，做平台</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgaaf9f08" class="outline-2">
<h2 id="orgaaf9f08"><span class="section-number-2">4</span> 换位思维</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org12f82bb" class="outline-3">
<h3 id="org12f82bb"><span class="section-number-3">4.1</span> how</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>从利益思考</li>
<li>从他人所在生态思考</li>
<li>从他人视角，需要有（部分）共同的认知</li>
</ul>
</div>
</div>

<div id="outline-container-org874c086" class="outline-3">
<h3 id="org874c086"><span class="section-number-3">4.2</span> 克服个人为中心</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>经常问自己“如果是我他，我会怎么做”</li>
<li>建立抽离感</li>
<li>观察他人的喜好</li>
</ul>
</div>
</div>

<div id="outline-container-orgc4c6092" class="outline-3">
<h3 id="orgc4c6092"><span class="section-number-3">4.3</span> 训练</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>从经历与认知着手</li>
<li>从逻辑推演着手</li>
<li>从细微观察着手</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orga0a229e" class="outline-2">
<h2 id="orga0a229e"><span class="section-number-2">5</span> 兵法思维</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org01cb93f" class="outline-3">
<h3 id="org01cb93f"><span class="section-number-3">5.1</span> 先胜后战</h3>
<div class="outline-text-3" id="text-5-1">
<p>
本质:如何平衡机会和风险。
</p>
</div>

<div id="outline-container-org055ba57" class="outline-4">
<h4 id="org055ba57"><span class="section-number-4">5.1.1</span> 凯利公式</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
用凯利公式计算可能性：
</p>

<p>
f=(p<sub>w</sub>r<sub>w</sub>-p<sub>l</sub>r<sub>l</sub>)/r<sub>w</sub>r<sub>l</sub>
</p>

<ul class="org-ul">
<li>p<sub>w</sub>赢的概率，r<sub>w</sub>赢了赚多少倍</li>
<li>p<sub>l</sub>输的概率，r<sub>l</sub>输了亏多少倍</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgafa08c2" class="outline-3">
<h3 id="orgafa08c2"><span class="section-number-3">5.2</span> 致人而不致于人</h3>
<div class="outline-text-3" id="text-5-2">
<p>
本质：如何识别隐藏风险，掌握主动权。
</p>

<p>
不要让自己处于两难的情形中，要让自己进退自如。
</p>
</div>
</div>

<div id="outline-container-org5c08f53" class="outline-3">
<h3 id="org5c08f53"><span class="section-number-3">5.3</span> 胜可知而不可为</h3>
<div class="outline-text-3" id="text-5-3">
<p>
本质：没有机会的时候要充实自己，不要逆势而为。
</p>
</div>
</div>
</div>

<div id="outline-container-org859eb72" class="outline-2">
<h2 id="org859eb72"><span class="section-number-2">6</span> 创造性思维</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org018c358" class="outline-3">
<h3 id="org018c358"><span class="section-number-3">6.1</span> 奥斯本核检表</h3>
<div class="outline-text-3" id="text-6-1">
<p>
用电扇举例：
</p>

<ul class="org-ul">
<li>他用，物品用作他用。（吹凉-&gt;摄影吹头发）</li>
<li>借用，借用过往经验，类比参考法。</li>
<li>扩大，增加功能、性能。（常温-&gt;冷风，热风）</li>
<li>缩小，减少功能等。（正常尺寸-&gt;车载，微型，吹风-&gt;赶苍蝇）</li>
<li>改变，外观形状，气味，功能等。（彩色扇叶）</li>
<li>代用，替代全部或部分功能，材料，颜色等。（遥控电扇）</li>
<li>调整，操作工序（变速）。</li>
<li>颠倒，正反，前后，功能作用方式。（吹风-&gt;抽风，座扇-&gt;吊扇）</li>
<li>组合，多个物件进行组合配套。（吹蚊香液，发光电扇）</li>
</ul>
</div>
</div>

<div id="outline-container-org3b996d5" class="outline-3">
<h3 id="org3b996d5"><span class="section-number-3">6.2</span> 乘法式创新</h3>
</div>

<div id="outline-container-org4df191b" class="outline-3">
<h3 id="org4df191b"><span class="section-number-3">6.3</span> 强制联想法</h3>
</div>
</div>

<div id="outline-container-orgb4fdd30" class="outline-2">
<h2 id="orgb4fdd30"><span class="section-number-2">7</span> 大势思维</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-04-26 日 10:52</p>
<p class="validation"></p>
</div>
</body>
</html>
